In [1]:
import pandas as pd

In [2]:
import numpy as np

In [5]:
d={"book-name":["hindi","english","science","maths","history"],
   "book-price":[100,110,130,150,115],
   "book-pages":[70,90,120,250,220]
}

In [6]:
df=pd.DataFrame(d)

In [7]:
df

  book-name  book-price  book-pages
0     hindi         100          70
1   english         110          90
2   science         130         120
3     maths         150         250
4   history         115         220

In [8]:
df.to_csv('hello.csv')

In [9]:
df.to_csv('hello_without.csv',index=False)

In [10]:
df.head()

  book-name  book-price  book-pages
0     hindi         100          70
1   english         110          90
2   science         130         120
3     maths         150         250
4   history         115         220

In [11]:
df.head(2)

  book-name  book-price  book-pages
0     hindi         100          70
1   english         110          90

In [12]:
df.tail()

  book-name  book-price  book-pages
0     hindi         100          70
1   english         110          90
2   science         130         120
3     maths         150         250
4   history         115         220

In [13]:
df.tail(2)

  book-name  book-price  book-pages
3     maths         150         250
4   history         115         220

In [14]:
df['book-name']

0      hindi
1    english
2    science
3      maths
4    history
Name: book-name, dtype: object

In [15]:
df.describe()

       book-price  book-pages
count    5.000000    5.000000
mean   121.000000  150.000000
std     19.493589   80.311892
min    100.000000   70.000000
25%    110.000000   90.000000
50%    115.000000  120.000000
75%    130.000000  220.000000
max    150.000000  250.000000

In [16]:
f=pd.read_csv('iris.csv')

In [17]:
f

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [18]:
f.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [19]:
f['Species'][123]

'Iris-virginica'

In [20]:
f[f['SepalLengthCm'] == 6.7]['Species']

65     Iris-versicolor
77     Iris-versicolor
86     Iris-versicolor
108     Iris-virginica
124     Iris-virginica
140     Iris-virginica
144     Iris-virginica
145     Iris-virginica
Name: Species, dtype: object

In [21]:
df

  book-name  book-price  book-pages
0     hindi         100          70
1   english         110          90
2   science         130         120
3     maths         150         250
4   history         115         220

In [22]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [23]:
df.index=['I','II','III','IV','V']

In [24]:
df.index

Index(['I', 'II', 'III', 'IV', 'V'], dtype='object')

In [25]:
df.columns

Index(['book-name', 'book-price', 'book-pages'], dtype='object')

In [26]:
df.to_numpy()

array([['hindi', 100, 70],
       ['english', 110, 90],
       ['science', 130, 120],
       ['maths', 150, 250],
       ['history', 115, 220]], dtype=object)

In [27]:
df.T

                I       II      III     IV        V
book-name   hindi  english  science  maths  history
book-price    100      110      130    150      115
book-pages     70       90      120    250      220

In [28]:
df.sort_index(axis=0, ascending=False)

    book-name  book-price  book-pages
V     history         115         220
IV      maths         150         250
III   science         130         120
II    english         110          90
I       hindi         100          70

In [29]:
df.sort_index(axis=0, ascending=True)

    book-name  book-price  book-pages
I       hindi         100          70
II    english         110          90
III   science         130         120
IV      maths         150         250
V     history         115         220

In [30]:
df['book-pages'].isnull()

I      False
II     False
III    False
IV     False
V      False
Name: book-pages, dtype: bool

In [31]:
df['book-pages']=None

In [32]:
df['book-pages'].isnull()

I      True
II     True
III    True
IV     True
V      True
Name: book-pages, dtype: bool

In [33]:
df

    book-name  book-price book-pages
I       hindi         100       None
II    english         110       None
III   science         130       None
IV      maths         150       None
V     history         115       None

In [34]:
df.fillna(0, inplace=True)

In [35]:
df

    book-name  book-price  book-pages
I       hindi         100           0
II    english         110           0
III   science         130           0
IV      maths         150           0
V     history         115           0

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, I to V
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   book-name   5 non-null      object
 1   book-price  5 non-null      int64
 2   book-pages  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 332.0+ bytes

In [37]:
f[f['SepalLengthCm'] == 6.7]['Species']

65     Iris-versicolor
77     Iris-versicolor
86     Iris-versicolor
108     Iris-virginica
124     Iris-virginica
140     Iris-virginica
144     Iris-virginica
145     Iris-virginica
Name: Species, dtype: object

In [38]:
f.groupby('Species')['SepalLengthCm'].mean()

Species
Iris-setosa        5.006
Iris-versicolor    5.936
Iris-virginica     6.588
Name: SepalLengthCm, dtype: float64

In [39]:
f

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica